backend/controllers/ContractFormEstateOfficeController.php

    public function actionIndex()
    {
        $adminForms = ContractForm::find()->where(['status' => 1])->all();
        $estate_office_id = \common\components\GeneralHelpers::getEstateOfficeId();
        foreach ($adminForms as $adminForm ) {
            $estateOfficeForm = ContractFormEstateOffice::find()->where(['estate_office_id' => $estate_office_id,'contract_form_id' => $adminForm->id])->One();
---
SELECT * FROM `contract_form` WHERE `status`=1
SELECT * FROM `contract_form_estate_office` WHERE (`estate_office_id`=31) AND (`contract_form_id`=1)