backend/controllers/CouponsController.php

SELECT * FROM `coupons` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Coupon::findOne($id)) !== null) {