backend/controllers/EstateOfficeController.php

    protected function findModel($id)
    {
        if (($model = EstateOffice::findOne($id)) !== null) {
---
SELECT * FROM `estate_office` WHERE `id`='61'