backend/controllers/NotifTempEstateOfficeController.php

    public function actionIndex()
    {
        // print_r(NotifTempEstateOffice::NOTIF_AVALIBAL_FOR_ESTATE_OFFICE); die();
        $adminTemps = NotifTemp::find()->where(['id'=> NotifTempEstateOffice::NOTIF_AVALIBAL_FOR_ESTATE_OFFICE ])->all();
        $estate_office_id = \common\components\GeneralHelpers::getEstateOfficeId();
        foreach ($adminTemps as $adminTemp ) {
            $estateOfficeForm = NotifTempEstateOffice::find()->where(['estate_office_id' => $estate_office_id,'notification_id' => $adminTemp->id])->One();
---
SELECT * FROM `notif_temp` WHERE `id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19)
SELECT * FROM `notif_temp_estate_office` WHERE (`estate_office_id`=31) AND (`notification_id`=1)