backend/controllers/PlanController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        $modelsPlanItem = PlanItem::find()->where(['plan_id'=>$model->id])->all();
---
SELECT * FROM `plan_item` WHERE `plan_id`=11

    protected function findModel($id)
    {
        if (($model = Plan::findOne($id)) !== null) {
---
SELECT * FROM `plan` WHERE `id`='11'