backend/controllers/QrCodeController.php

    public function actionIndex()
    {
        $exportQrCode = new ExportController(1, new QrCode(1));
        $currentUser = \common\models\Chat::getInfoUser();

        if ($currentUser['userType'] == 'estate_officer') {
            $office = EstateOffice::findOne($currentUser['userId']);
---
SELECT * FROM `estate_office` WHERE `id`=31