backend/controllers/SiteController.php

SELECT COUNT(*) FROM `maintenance_office`
SELECT COUNT(*) FROM `estate_office`
SELECT COUNT(*) FROM `estate_office` WHERE `expire_date` <= '2024-03-18'
SELECT COUNT(*) FROM `user` WHERE (`user_type`='owner') OR (`owner`=1)
SELECT COUNT(*) FROM `user` WHERE (`user_type`='renter') OR (`renter`=1)
SELECT `building_type_id`, count(*) AS `countbuilding` FROM `building` GROUP BY `building_type_id` ORDER BY `countbuilding` DESC LIMIT 10
SELECT * FROM `user` WHERE ((`user_type` IN ('owner', 'renter')) OR ((`owner`=1) AND (`renter`=1))) AND (`black_list`=1) LIMIT 3
SELECT `estate_office_id`, count(*) AS `count`, sum(price) AS `amounts` FROM `contract` WHERE is_draft = 0 GROUP BY `estate_office_id` ORDER BY `amounts` DESC LIMIT 5
SELECT * FROM `estate_office` WHERE `id` IN (2, 31, 66, 3)
SELECT sum(amount) AS `amount` FROM `system_expense`
SELECT sum(amount) AS `amount` FROM `system_income`
---
    private function dashboardAdmin()
    {
        $countMaintenance = MaintenanceOffice::find()->count();
        $countEstate = EstateOffice::find()->count();
        $countEstateExpaire = EstateOffice::find()->where(['<=','expire_date',date("Y-m-d")])->count();
        $countOwner = User::find()->where(['or',['user_type'=>'owner'],['owner'=>1]])->count();
        $countRenter = User::find()->where(['or',['user_type'=>'renter'],['renter'=>1]])->count();

        $building = Building::find()->select(['building_type_id','count(*) as countbuilding'])->groupBy(['building_type_id'])->limit(10)->orderBy(['countbuilding'=> SORT_DESC])->asArray()->all();
        $buildingType = BuildingType::getBuildingTypeName();

        $chat = Chat::find()->CurrentUser()->orderBy(['id'=> SORT_DESC])->all();
        $countNewChat = Chat::find()->joinWith(['chatHistories' => function($query) {
            $query->unread();
        }])->CurrentUser()->count();
            // print_r($countNewChat);die();
        $blackList = User::find()->where(['And',['or',['in','user_type',['owner','renter']],['owner'=>1,'renter'=>1]],['black_list'=>1]])->limit(3)->all();
        $contracts = Contract::find()
                ->select(['estate_office_id', 'count(*) as count', 'sum(price) as amounts'])
                ->groupBy ('estate_office_id')->orderBy(['amounts'=> SORT_DESC])->asArray()->limit(5)->all();

        $estateOfficeIds = Arrayhelper::map($contracts, 'estate_office_id', 'estate_office_id');

        $estateOfficeNames = Arrayhelper::map(EstateOffice::find()->where(['id' => $estateOfficeIds])->asArray()->all(),"name","name") ;

        $expense = SystemExpense::find()->select(['sum(amount) as amount'])->asArray()->all();
        $income = SystemIncome::find()->select(['sum(amount) as amount'])->asArray()->all();

SELECT COUNT(*) FROM `user` LEFT JOIN `estate_office_owner` ON user.id = estate_office_owner.owner_id WHERE (`estate_office_id`=31) AND ((`user_type`='owner') OR (`owner`=1))
SELECT `building`.`id` FROM `building` LEFT JOIN `estate_office_building` `eob` ON building.id = eob.building_id WHERE (`estate_office_id`=31) AND (`is_active`=1)
SELECT `building_type_id`, count(*) AS `countbuilding` FROM `building` WHERE `id` IN (45, 50, 55, 56, 60, 82, 83, 110, 114, 115, 121, 132, 156, 157, 163, 164, 166, 167, 169, 172, 173, 178, 180, 181, 182, 183, 184, 186, 190, 192, 193, 194, 195, 198) GROUP BY `building_type_id` ORDER BY `countbuilding` DESC LIMIT 10
SELECT `building_type_id`, count(*) AS `count` FROM `building_housing_unit` WHERE `building_id` IN (45, 50, 55, 56, 60, 82, 83, 110, 114, 115, 121, 132, 156, 157, 163, 164, 166, 167, 169, 172, 173, 178, 180, 181, 182, 183, 184, 186, 190, 192, 193, 194, 195, 198) GROUP BY `building_type_id` ORDER BY `count` DESC LIMIT 10
SELECT `installment`.`id`, `contract_id` FROM `installment` LEFT JOIN `contract` ON (`installment`.`contract_id` = `contract`.`id`) AND (is_draft = 0) WHERE `contract`.`estate_office_id`=31
SELECT * FROM `contract` WHERE (`id` IN (194, 203, 204, 215, 216, 217, 249, 250, 270, 271, 272, 278, 279, 280, 300, 301, 302, 303, 308, 310, 316, 317, 325, 326, 327, 329, 330, 331, 332, 333, 334, 335, 360, 361)) AND (is_draft = 0)
SELECT COUNT(*) FROM `installment` WHERE ((`id` IN (201, 202, 217, 218, 219, 242, 243, 244, 245, 246, 247, 276, 277, 278, 294, 295, 296, 297, 298, 299, 310, 311, 312, 313, 314, 315, 343, 344, 345, 347, 348, 349, 350, 357, 358, 361, 362, 373, 374, 375, 376, 387, 388, 389, 390, 391, 392, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 431, 432, 433, 434)) AND (`payment_status`=0)) AND (`installment`.`start_date` < '2024-03-21')
SELECT COUNT(*) FROM `installment` WHERE ((`id` IN (201, 202, 217, 218, 219, 242, 243, 244, 245, 246, 247, 276, 277, 278, 294, 295, 296, 297, 298, 299, 310, 311, 312, 313, 314, 315, 343, 344, 345, 347, 348, 349, 350, 357, 358, 361, 362, 373, 374, 375, 376, 387, 388, 389, 390, 391, 392, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 431, 432, 433, 434)) AND (`payment_status`=0)) AND (DATE_FORMAT(installment.start_date, "%Y-%m") = '2024-03')
---
    private function dashboardEstate($id)
    {
        $estate_office_id = $id;
        $countOwner = User::find()->where(['estate_office_id' => $estate_office_id])->AndWhere(['or',['user_type'=>'owner'],['owner'=>1]])->leftJoin('estate_office_owner', 'user.id = estate_office_owner.owner_id')->count();
        $countContractOpen = Contract::find()->currentOffice($estate_office_id)->withDraft()->active()->count();
        $countContractClose = Contract::find()->currentOffice($estate_office_id)->withDraft()->active(0)->count();

        $buildingIds = Building::find()->select(['building.id'])->leftJoin('estate_office_building as eob','building.id = eob.building_id'
            )->where(['estate_office_id'=> $estate_office_id,'is_active'=>1])->asArray()->all();
        $buildingIds = ArrayHelper::getColumn($buildingIds, 'id');

        $building = Building::find()->select(['building_type_id','count(*) as countbuilding'])
        ->where(['id'=>$buildingIds])->groupBy(['building_type_id'])->orderBy(['countbuilding'=> SORT_DESC])->limit(10)->asArray()->all();
        $buildingType = BuildingType::getBuildingTypeName();


        $housing = BuildingHousingUnit::find()->select(['building_type_id','count(*) as count'])->where(['building_id'=>$buildingIds])->groupBy(['building_type_id'])->limit(10)->orderBy(['count'=> SORT_DESC])->asArray()->all();
        $housingType = $buildingType;

        $chat = Chat::find()->CurrentUser()->orderBy(['id'=> SORT_DESC])->all();

        $InstaIds = Installment::find()->joinWith(['contract'])->select(['installment.id','contract_id'])->where(['contract.estate_office_id' => $estate_office_id])->asArray()->all();
        $InstaIds = ArrayHelper::getColumn($InstaIds, 'id');
        $InstaAll = count($InstaIds);
        // $InstaEnd->select(['DATE_FORMAT(installment.start_date, "%d-%m-%Y") as endDate'])->where(['>=','start_date',date("Y-m-d")])->one();
        $InstaEnd= Installment::find()->where(['id'=>$InstaIds,'payment_status'=>Installment::STATUS_UNPAID])->andWhere(['<','installment.start_date',date("Y-m-d")])->count();
        $InstaInMonth = Installment::find()->where(['id'=>$InstaIds,'payment_status'=>Installment::STATUS_UNPAID])->andWhere(['=','DATE_FORMAT(installment.start_date, "%Y-%m")',date("Y-m")])->count();