backend/controllers/TakamolatController.php

SELECT * FROM `gallery` WHERE `user_id`=94
---
    public function actionIndex()
    {

//        return $this->render('index');

//        $json = file_get_contents(Yii::getAlias('@common') . '/takamolat.json');
//
//        $json = json_decode($json);
//
////        return dd($json->Body);
///
///
        $userId = Yii::$app->user->id;
        $searchModel = Gallery::find();

        if (in_array(yii::$app->user->identity->user_type, ['estate_officer', 'owner_estate_officer'])) {
            $searchModel = $searchModel->where(['user_id' => $userId]);
        }

        $dataProvider = (new Gallery())->search(Yii::$app->request->queryParams, $searchModel);

        return $this->render('index', [
            'searchModel' => $searchModel->all(),
            'dataProvider' => $dataProvider
        ]);

SELECT EXISTS(SELECT * FROM `gallery` WHERE `adLicenseNumber`='7100046943')
---
    private function checkIfExists($adLicenseNumber)
    {
        return Gallery::find()->where(['adLicenseNumber' => $adLicenseNumber])->exists();

SELECT * FROM `gallery` WHERE `id`=14
---
    public function actionView(int $id)
    {
//        $adLicenseNumber = '7100041957';
//        $advertiserId = '1011260294';

//        dd($this->getTakamolat($adLicenseNumber, $advertiserId,1));

        $model = Gallery::find()->where(['id' => $id])->one();