backend/views/estate-office/_form.php

SELECT * FROM `nationality`
---
				<div class='col-sm-4'><?= $form->field($model, 'email')->textInput(['maxlength' => true])->label(false) ?></div>
				<label for='' class='col-sm-2 control-label'><?=Yii::t('app', 'Nationality')?></label>
		        <div class='col-sm-4'>
		        	<?= $form->field($model, '_nationality_id')->widget(Select2::class, ['data' =>ArrayHelper::map(Nationality::find()->all(),'id','_name'),'options' => ['prompt'=>Yii::t('app','Select Nationality')]])->label(false)?>

SELECT * FROM `city` WHERE `status`=1
---
                <label for='' class='col-sm-2 control-label'><?= Yii::t('app', 'City ID') ?> </label>

				<div class='col-sm-4'>
					<?= $form->field($model, 'city_id')->widget(Select2::class, ['data' =>ArrayHelper::map(City::find()->where(['status'=>1])->all(),'id','_name'),'options' => ['prompt'=>Yii::t('app','Select City')]])->label(false)?>