backend/views/estate-office/index.php

                    'auth_person',
                    [
                        'attribute' => 'city_id',
                        'filter' => ArrayHelper::map(City::find()->where(['>', 'id', 0])->all(), 'id', '_name'),
---
SELECT * FROM `city` WHERE `id` > 0

                    ],
                    [
                        'attribute' => 'district_id',
                        'filter' => ArrayHelper::map(District::find()->where(['>', 'id', 0])->all(), 'id', '_name'),
---
SELECT * FROM `district` WHERE `id` > 0