backend/views/plan/view.php

SELECT COUNT(*) FROM `plan_item` WHERE `plan_id`=11
---
            [
                'attribute'=>yii::t('app','Count Features'),
                'value'=> function($model) {
                    return $model->getPlanItems()->count()?? 0;

SELECT COUNT(*) FROM `order` WHERE `plan_id`=11
---
            [
                'label'=> yii::t('app','Count Orders'),
                'value'=> function($model) {
                    return $model->getOrders()->count()?? 0;