common/components/MultiUserType.php

SELECT * FROM `user` WHERE `id`=2
---
    public static function activeUserTypes($user_id = null)
    {
        $availableUserType = yii::$app->params['userType'][Yii::$app->language];
        $user = \common\models\User::findOne(($user_id)? $user_id : yii::$app->user->identity->id);