common/components/SiteSetting.php

    public function siteName()
    {
        $query = Setting::find()->select(['site_name_en', 'site_name'])->where('id=1')->One()->_site_name;
---
SELECT `site_name_en`, `site_name` FROM `setting` WHERE id=1

    public function info()
    {
        if ($this->_myData !== null) return $this->_myData;
        $this->_myData = Setting::findOne(1);
---
SELECT * FROM `setting` WHERE `id`=1