common/models/BuildingType.php

SELECT * FROM `building_type`
---
    public static function getBuildingTypeName()
    {
         $droptions = BuildingType::find()->asArray()->all();