common/models/District.php

    public static function ListDistrictByCar($city=0)
    {
		if (!empty($city) && $city!=0)
			$droptions = District::find()->where(['city_id'=>$city,'status'=>1])->asArray()->all();
		else
			$droptions = District::find()->where(['status'=>1])->asArray()->all();
---
SELECT * FROM `district` WHERE `status`=1