common/models/Notification.php

    public static function find()
    {
        $currentUser = \common\models\Chat::getInfoUser();
        return parent::find()->andwhere(['receiver_id' => $currentUser['userId'] ,'receiver_type'=>$currentUser['userType']])->orderBy(['status_read'=>SORT_ASC,'id' =>SORT_DESC]);
---
SELECT * FROM `notification` WHERE ((`receiver_id`=0) AND (`receiver_type`='admin')) AND (`status_read`=0) ORDER BY `status_read`, `id` DESC