common/models/User.php

    public static function findByUsername($username)
    {
        return static::find()->where(['username' => $username])->Orwhere(['email'=>$username])->one();
---
SELECT * FROM `user` WHERE (`username`='1010172409') OR (`email`='1010172409')