backend/views/maintenance-office/index.php

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],
            'id',
            'name',
            'auth_person',
            'mobile',
            'registration_code',
            [

                'format' => 'html',
                'attribute'=>'logo',
                'value' => function ($model) {
                  return Html::img($model->logo,
                    ['width' => '100px']);
                },
            ],
            //'logo',
            [
                'attribute' =>'city_id',
                'filter'=> ArrayHelper::map(City::find()->where(['>','id',0])->all(),'id','_name'),
                'value'=> 'city._name'
            ],
            [
                'attribute' =>'district_id',
                'filter'=> ArrayHelper::map(District::find()->where(['>','id',0])->all(),'id','_name'),
---
SELECT * FROM `city` WHERE `id`=4
SELECT * FROM `city` WHERE `id` > 0
SELECT * FROM `district` WHERE `id` > 0

            [
               'label'=>yii::t('app','Number').' '.yii::t('app','Order Maintenances'),
               'value'=> function($model) {
                    $orders = \common\models\OrderMaintenance::find()->where(['maintenance_office_id' => $model->id])->all();
---
SELECT * FROM `order_maintenance` WHERE `maintenance_office_id`=1

            [
               'label'=>yii::t('app','Number').' '.yii::t('app','Opened Orders'),
               'value'=> function($model) {
                    $orders = \common\models\OrderMaintenance::find()->where(['maintenance_office_id' => $model->id])->andWhere(['!=','status' , 10])->all();
---
SELECT * FROM `order_maintenance` WHERE (`maintenance_office_id`=1) AND (`status` != 10)

            [
               'label'=>yii::t('app','Number').' '.yii::t('app','Closed Orders'),
               'value'=> function($model) {
                    $orders = \common\models\OrderMaintenance::find()->where(['id' => $model->id])->andWhere(['=','status' , 10])->all();
---
SELECT * FROM `order_maintenance` WHERE (`id`=1) AND (`status` = 10)