backend/views/order/index.php

            'email:email',
            // 'company_name',
            //'plan_id',
            [
                'attribute' => 'plan_id',
                'format' => 'raw',
                'filter'=> ArrayHelper::map(Plan::find()->all(),'id','_title'),
                'value'=> function($model) {
                    return Html::a($model->plan->_title.'  &nbsp;'.Html::tag('i',null,['class'=>'fa fa-share-square-o']),Yii::$app->homeUrl.'plan/'.$model->plan->id,['style'=>'color:#3c8dbc!important;']);
                }
            ],
---
SELECT * FROM `plan` WHERE `id`=10
SELECT * FROM `plan`